"""
Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
[”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”
"""

numbers_list = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]


def sum_of_digits(numbers: list):
    """
    Function to sum list of digits
    :param numbers: list to sum
    :return: the sum of all digits
    """
    for num in numbers:
        try:
            number_list = num.split(",")  # прибрала коми між числами і буквами
            # приводжу кожен елемент на число і рахую суму
            result = 0
            for i in number_list:
                result += int(i)  # перетворюю  на число
            print(result)
        except ValueError as e:
            # виводжу текст і помидку у випадку коли у списку є не числові значення
            print("Не можу це зробити!", e)


print(sum_of_digits(numbers_list))
