"""
task 01 == Виправте синтаксичні помилки
"""

print("Hello", end=" ")
print("world!")

"""
task 02 == Виправте синтаксичні помилки
"""

hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

"""
task 03  == Вcтавте пропущену змінну у ф-цію print
"""

for letter in "Hello world!":
    print(letter)

"""
task 04 == Зробіть так, щоб кількість бананів була
завжди в чотири рази більша, ніж яблук
"""

apples = 2
banana = apples * 4
print(banana)

"""
task 05 == виправте назви змінних
"""

side_1 = 1
side_2 = 2
side_3 = 3
side_4 = 4

"""
task 06 == Порахуйте периметр фігури з task 05
та виведіть його для користувача
"""

perimeter = side_1 + side_2 + side_3 + side_4
print(perimeter)

"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07

"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""

apple_trees = 4
pear_trees = apple_trees + 5
peach_trees = apple_trees - 2
total_amount = apple_trees + pear_trees + peach_trees
print(total_amount)

# task 08

"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
morning_temperature = 5
noon_temperature = morning_temperature - 10
evening_temperature = noon_temperature + 4
print("До обіда температура повітря була на", morning_temperature, "градусів вище нуля.",
      "Після обіду температура опустилася на", noon_temperature, "градусів.",
      "Надвечір потепліло на 4 градуси. Яка температура надвечір?",
      "Температура ввечері дорівнює:", evening_temperature
      )

# task 09

"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24
girls = boys / 2
all_kids = (boys - 1) + (girls - 2)
print("Взагалі у театральному гуртку -", boys, "хлопчики, а дівчаток -", int(girls), ".",
      "1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.",
      "Скількі сьогодні дітей у театральному гуртку?",
      "Результат", boys, "+", int(girls), "=", int(all_kids)
      )

# task 10

"""
Перша книжка коштує 8 грн., друга - на 2 грн. дорожче,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
first_book = 8
second_book = first_book + 2
third_book = first_book + second_book / 2
books_price = first_book + second_book + third_book
print("Перша книжка коштує", first_book, "грн.,",
      "друга -", second_book, "грн,",
      "а третя -", int(third_book), "грн.",
      "Скільки будуть коштувати усі книги, якщо купити по одному примірнику?",
      "Результат", first_book, "+", second_book, "+", int(third_book), "=", int(books_price)
      )
